package com.serene.iopractice;

/**
 * Description:
 *
 * @author Serene Lee
 * @date 2025/12/25
 */
public class Practice5 {
    public static void main(String[] args) {
        /*
        随机点名器4（学生独立完成）
        需求:
        一个文件里面存储了班级同学的姓名，每一个姓名占一行。
        要求通过程序实现随机点名器。
        运行效果：
        被点到的学生不会再次被点到
        如果班级中所有的学生都点完了，需要自动的重新开启第二轮点名
        细节1：假设班级有10个学生，每一轮中每一位学生只能被点到一次，程序运行10次，第一轮结束
        细节2：第11次运行的时候，我们自己不需要手动操作本地文件，要求程序自动开始第二轮点名
         */

        // 代码在之前写过很多次了，此处不再写了

    }

}
